// Материал к прочтению:
// https://www.w3schools.com/js/js_loop_while.asp
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/for
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/while
// https://learn.javascript.ru/while-for

// Задачки:

// 1. Задача с интервью*
// y Bac ecть массив co скобками
// Количество элементов и последовательность может быть разной.
// Нужно выяснить, у каждой ли скобки есть соответствующая пара (открывающая и закрывающая).
// Решение должно работать для всех массивов внизу.

// Первая последовательность: [(, ')', (', ')', *)']
// Вторая последовательность: ['(', ')', '(', ')', '{', '(', '}' ')', 2, 'a']
// Еще: ['(', ')', '(', '(', '(', ')', '}', '(', ')', ')']

// 2. Найти самое маленькое число из массива [4, 81, 3, -12, 99, 14]

// 3. Найти самое большое число из массива [4, 81, 3, -12, 99, 14]

// 4. Найти сумму всех элементов массива [[1, 2], [3, 4, 5], [6, 7, 8], 9, [10], [0, 11], "Hello"]

// 5. При помощи цикла for выведите чётные числа от 2 до 10

// 6. Переделайте задачку с улиткой используя циклы
//  Улитка ползёт вверх по стене высотой 5 метров. Каждый день она проползает вверх на 3 метра,
//  а каждую ночь съезжает вниз на 2 метра. За сколько дней она доползет до вершины стены.

// 7. Есть код. Какой будет результат этого кода и почему
